.config/emacs/README.org
#+title: Druhan's Emacs Configuration
#+author: Druhan Shah

#+startup: overview
#+property: header-args :tangle init.el
#+auto_tangle: t

This configuration is heavily based off of [[https://github.com/rougier][Nicolas Rougier]]'s emacs packages and ideas. All the packages taken more or less verbatim from Mr. Rougier's repositories are in the =nano/= directory and any other configuration files are in the =not-nano/= directory.

This is a literate configuration, which means all the code blocks in this Org file will be exported using Org-Babel's tangle feature into their corresponding config files on save. As a result, all the configuration necessary will be in this file as far as possible. Sometime in the future, a Table of Contents will be implemented to make navigating this document easier.

* Preambles 

The Early-Init file is executed before =init.el=, and hence is where we disable =package.el= in favour of Elpaca.

#+begin_src emacs-lisp :tangle early-init.el
  ;; Early-init file, executed before init.el when starting Emacs

  (setq package-enable-at-startup nil)
#+end_src

Now, we throw in a preamble comment in the Init file just in case someone reads it before this README :P

#+begin_src emacs-lisp
  ;; ---------------------------------------------
  ;;              EMACS INIT FILE
  ;; 
  ;; This is where all of my configuration for
  ;; GNU Emacs resides. Please read README.org for
  ;; more detailed information about the config.
  ;; ---------------------------------------------
#+end_src


* Package Manager (Elpaca)

This codeblock is directly from the Elpaca repository's README. I have only added a final expression integrating Elpaca with ~use-package~.

#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order
    '(elpaca :repo "https://github.com/progfolio/elpaca.git"
             :ref nil :depth 1 :inherit ignore
             :files (:defaults "elpaca-test.el" (:exclude "extensions"))
             :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop
                      (apply #'call-process
                             `("git" nil ,buffer t "clone"
                               ,@(when-let* ((depth (plist-get order :depth)))
                                   (list
  				  (format "--depth=%d" depth)
  				  "--no-single-branch"))
                               ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process
                             emacs nil buffer nil "-Q" "-L" "." "--batch"
                             "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
  (elpaca elpaca-use-package
    (elpaca-use-package-mode))
#+end_src


* Bits and bobs

This is a bunch of other niceties that I would like to have, since that would make configuration and usage a good bit easier.

- Garbage collector reduction for faster startup
- Add all files in the =nano/= directory into the loading path

#+begin_src emacs-lisp
  (setq gc-cons-threshold 63000000
        gc-cons-percentage 0.6)
  (add-to-list 'load-path "~/.config/emacs/nano")
#+end_src

** "Sane defaults"

This section deals with simple default values that I would like to have set by default for /my/ Emacs experience. These are by no means general statements on what should be the defaults.

#+begin_src emacs-lisp
  (setq inhibit-startup-screen t)
  (setq inhibit-startup-message t)
  (setq inhibit-startup-echo-area-message t)
  (setq initial-scratch-message nil)
  (setq initial-buffer-choice nil)

  (setq frame-title-format nil)
  (setq use-file-dialog nil)
  (setq use-dialog-box nil)
  (setq pop-up-windows nil)
  (setq indicate-empty-lines nil)
  (setq cursor-in-non-selected-windows nil)

  (setq initial-major-mode 'text-mode)
  (setq default-major-mode 'text-mode)
  (setq font-lock-maximum-decoration t)
  (setq auto-fill-mode nil)
  (setq fill-column 80)

  (setq-default cursor-type '(hbar .  2))
  (setq-default cursor-in-non-selected-windows nil)
  (setq blink-cursor-mode nil)

  (setq default-frame-alist
        (append (list
                 '(vertical-scroll-bars . nil)
                 '(internal-border-width . 20)
                 '(left-fringe . 16)
                 '(right-fringe . 0)
                 '(undecorated-round . t) ;; emacs-plu@29 only
                 '(scroll-bar-mode . -1)
                 '(tool-bar-lines . 0)
  	       '(tool-bar-position . left)
                 '(menu-bar-lines . 0))))

  (setq tool-bar-style 'image)

  (setq window-divider-default-right-width 20)
  (setq window-divider-default-places 'right-only)
  (window-divider-mode 1)

  (setq make-backup-files nil)

  (set-display-table-slot standard-display-table
                          'truncation
  			(make-glyph-code ?… 'font-lock-comment-face))
  (set-display-table-slot standard-display-table
                          'wrap
  			(make-glyph-code ?- 'font-lock-comment-face))
#+end_src

** Nice-to-haves

The first of likely many is smooth scrolling which I think would make me a lot happier coding in Emacs.

#+begin_src emacs-lisp
  (use-package ultra-scroll
    :ensure t
    :init
    (setq scroll-conservatively 3
  	scroll-margin 0)
    :config
    (ultra-scroll-mode 1))
#+end_src


* Themes and colours

I'm moving from Rougier's =nano-theme= and Prot's =modus-operandi= to a simple application of the Catppuccin themes, assuming there should be some unified way to apply the themes cleanly that works with my personal customizations as well as Rougier's other packages.

** Face overrides

#+begin_src emacs-lisp
  (defun drs/catppuccin-override ()
    "Override Catppuccin theme for specific faces."
    (interactive)
    (set-face-attribute 'org-document-title nil
  		      :foreground (catppuccin-color 'text)
  		      :weight 'bold
  		      :height 1.6)
    (set-face-attribute 'org-level-1 nil
  		      :foreground (catppuccin-color 'text)
  		      :weight 'bold
  		      :height 1.4)
    (set-face-attribute 'org-level-2 nil
  		      :foreground (catppuccin-color 'text)
  		      :weight 'bold
  		      :height 1.2)
    (set-face-attribute 'org-level-3 nil
  		      :foreground (catppuccin-color 'text)
  		      :weight 'bold
  		      :height 1.1)
    (set-face-attribute 'org-level-4 nil
  		      :foreground (catppuccin-color 'text)
  		      :weight 'bold)
    (set-face-attribute 'org-block-begin-line nil
  		      :box `(:line-width 8
  		      :color ,(catppuccin-color 'mantle)))
    (set-face-attribute 'vertical-border nil
  		      :foreground (catppuccin-color 'base))
    (set-face-attribute 'window-divider nil
  		      :foreground (catppuccin-color 'base))
    (set-face-attribute 'window-divider-first-pixel nil
  		      :foreground (catppuccin-color 'base))
    (set-face-attribute 'window-divider-last-pixel nil
  		      :foreground (catppuccin-color 'base))
    (catppuccin-reload))

  (add-hook 'elpaca-after-init-hook #'drs/catppuccin-override)
#+end_src

** Applying the theme

#+begin_src emacs-lisp
    (use-package catppuccin-theme
      :ensure t
      :config
      (setq catppuccin-flavor 'latte)
      (load-theme 'catppuccin t))
#+end_src


* Typography

This is all the stuff I need to improve typography when using Emacs. This includes coding ligatures, icons, and colour code rendering.

