.config/emacs/init.el
;; ---------------------------------------------
;;              EMACS INIT FILE
;; 
;; This is where all of my configuration for
;; GNU Emacs resides. Please read README.org for
;; more detailed information about the config.
;; ---------------------------------------------

(defvar elpaca-installer-version 0.11)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order
  '(elpaca :repo "https://github.com/progfolio/elpaca.git"
           :ref nil :depth 1 :inherit ignore
           :files (:defaults "elpaca-test.el" (:exclude "extensions"))
           :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (<= emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop
                    (apply #'call-process
                           `("git" nil ,buffer t "clone"
                             ,@(when-let* ((depth (plist-get order :depth)))
                                 (list
				  (format "--depth=%d" depth)
				  "--no-single-branch"))
                             ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process
                           emacs nil buffer nil "-Q" "-L" "." "--batch"
                           "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
(elpaca elpaca-use-package
  (elpaca-use-package-mode))

(setq gc-cons-threshold 63000000
      gc-cons-percentage 0.6)
(add-to-list 'load-path "~/.config/emacs/nano")

(setq inhibit-startup-screen t)
(setq inhibit-startup-message t)
(setq inhibit-startup-echo-area-message t)
(setq initial-scratch-message nil)
(setq initial-buffer-choice nil)

(setq frame-title-format nil)
(setq use-file-dialog nil)
(setq use-dialog-box nil)
(setq pop-up-windows nil)
(setq indicate-empty-lines nil)
(setq cursor-in-non-selected-windows nil)

(setq initial-major-mode 'text-mode)
(setq default-major-mode 'text-mode)
(setq font-lock-maximum-decoration t)
(setq auto-fill-mode nil)
(setq fill-column 80)

(setq-default cursor-type '(hbar .  2))
(setq-default cursor-in-non-selected-windows nil)
(setq blink-cursor-mode nil)

(setq default-frame-alist
      (append (list
               '(vertical-scroll-bars . nil)
               '(internal-border-width . 20)
               '(left-fringe . 16)
               '(right-fringe . 0)
               '(undecorated-round . t) ;; emacs-plu@29 only
               '(scroll-bar-mode . -1)
               '(tool-bar-lines . 0)
	       '(tool-bar-position . left)
               '(menu-bar-lines . 0))))

(setq tool-bar-style 'image)

(setq window-divider-default-right-width 20)
(setq window-divider-default-places 'right-only)
(window-divider-mode 1)

(setq make-backup-files nil)

(set-display-table-slot standard-display-table
                        'truncation
			(make-glyph-code ?… 'font-lock-comment-face))
(set-display-table-slot standard-display-table
                        'wrap
			(make-glyph-code ?- 'font-lock-comment-face))

(use-package ultra-scroll
  :ensure t
  :init
  (setq scroll-conservatively 3
	scroll-margin 0)
  :config
  (ultra-scroll-mode 1))

(defun drs/catppuccin-override ()
  "Override Catppuccin theme for specific faces."
  (interactive)
  (set-face-attribute 'org-document-title nil
		      :foreground (catppuccin-color 'text)
		      :weight 'bold
		      :height 1.6)
  (set-face-attribute 'org-level-1 nil
		      :foreground (catppuccin-color 'text)
		      :weight 'bold
		      :height 1.4)
  (set-face-attribute 'org-level-2 nil
		      :foreground (catppuccin-color 'text)
		      :weight 'bold
		      :height 1.2)
  (set-face-attribute 'org-level-3 nil
		      :foreground (catppuccin-color 'text)
		      :weight 'bold
		      :height 1.1)
  (set-face-attribute 'org-level-4 nil
		      :foreground (catppuccin-color 'text)
		      :weight 'bold)
  (set-face-attribute 'org-block-begin-line nil
		      :box `(:line-width 8
		      :color ,(catppuccin-color 'mantle)))
  (set-face-attribute 'vertical-border nil
		      :foreground (catppuccin-color 'base))
  (set-face-attribute 'window-divider nil
		      :foreground (catppuccin-color 'base))
  (set-face-attribute 'window-divider-first-pixel nil
		      :foreground (catppuccin-color 'base))
  (set-face-attribute 'window-divider-last-pixel nil
		      :foreground (catppuccin-color 'base))
  (catppuccin-reload))

(add-hook 'elpaca-after-init-hook #'drs/catppuccin-override)

(use-package catppuccin-theme
  :ensure t
  :config
  (setq catppuccin-flavor 'latte)
  (load-theme 'catppuccin t))
