.config/emacs/README.org
** Font setup

I'm using Prot's =fontaine= package to setup my default fonts, independent of Rougier's packages.

#+begin_src emacs-lisp
  (use-package fontaine
    :ensure t
    :config
    (setq fontaine-presets
  	'((default
  	   :default-family "Iosevka"
  	   :fixed-pitch-family "Iosevka"
  	   :variable-pitch-family "Inter"
  	   :mode-line-active-family "Inter"
  	   :mode-line-inactive-family "Inter"
  	   :header-line-family "Inter"

  	   :default-weight regular
  	   :bold-weight semi-bold
  	   :italic-slant italic

  	   :default-height 120
  	   :line-spacing 0.15)))
    (fontaine-set-preset 'default))
#+end_src

Nerd fonts tend to have some hiccups (lots of them), this block here should solve things ideally.

#+begin_src emacs-lisp
  (defun drs/nerd-fonts ()
    "Set up Nerd Fonts for specific codepoints."
    (interactive)
    (set-fontset-font t '(#x23fb . #x23fe) "Symbols Nerd Font")
    (set-fontset-font t '(#x2500 . #x259f) "Symbols Nerd Font")
    (set-fontset-font t '(#x276c . #x2771) "Symbols Nerd Font")
    (set-fontset-font t '(#xe000 . #xe00a) "Symbols Nerd Font")
    (set-fontset-font t '(#xe0a0 . #xe0a3) "Symbols Nerd Font")
    (set-fontset-font t '(#xe0b0 . #xe0d7) "Symbols Nerd Font")
    (set-fontset-font t '(#xe200 . #xe2a9) "Symbols Nerd Font")
    (set-fontset-font t '(#xe300 . #xe3e3) "Symbols Nerd Font")
    (set-fontset-font t '(#xe5fa . #xe6b7) "Symbols Nerd Font")
    (set-fontset-font t '(#xe700 . #xe8ef) "Symbols Nerd Font")
    (set-fontset-font t '(#xea60 . #xec1e) "Symbols Nerd Font")
    (set-fontset-font t '(#xed00 . #xf2ff) "Symbols Nerd Font")
    (set-fontset-font t '(#xee00 . #xee0b) "Symbols Nerd Font")
    (set-fontset-font t '(#xf300 . #xf381) "Symbols Nerd Font")
    (set-fontset-font t '(#xf400 . #xf533) "Symbols Nerd Font")
    (set-fontset-font t '(#xf0001 . #xf1af0) "Symbols Nerd Font"))

  (add-hook 'server-after-make-frame-hook #'drs/nerd-fonts)
#+end_src

** Nice-to-haves

#+begin_src emacs-lisp
  (use-package ligature
    :ensure t
    :config
    (ligature-set-ligatures
     'prog-mode '("<---" "<--"  "<<-" "<-" "->" "-->" "--->" "<->" "<-->" "<--->"
  		"<---->" "<!--" "<==" "<===" "<=" "=>" "=>>" "==>" "===>" ">=" "<=>"
  		"<==>" "<===>" "<====>" "<!---" "<~~" "<~" "~>" "~~>" "::" ":::"
  		"==" "!=" "===" "!==" ":=" ":-" ":+" "<*" "<*>" "*>" "<|" "<|>" "|>"
  		"+:" "-:" "=:" "<******>" "++" "+++"))
    (global-ligature-mode t))


  (use-package nerd-icons
    :ensure t
    :if (display-graphic-p)
    :config
    (setq nerd-icons-font-family "Symbols Nerd Font"))

  (use-package nerd-icons-dired
    :ensure t
    :after nerd-icons
    :hook (dired-mode . nerd-icons-dired-mode))

  (use-package nerd-icons-ibuffer
    :ensure t
    :after nerd-icons
    :hook (ibuffer-mode . nerd-icons-ibuffer-mode)
    :config
    (setq nerd-icons-ibuffer-formats
  	'(("  "
  	   mark " "
  	   (icon 2 2) " "
  	   (name 24 24 :left :elide) "  "))))

  (use-package nerd-icons-corfu
    :ensure t
    :after nerd-icons
    :after corfu
    :config (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

  (use-package colorful-mode
    :ensure t
    :config
    (global-colorful-mode))

  (elpaca-wait)
#+end_src


* Vim Emulation

I use Evil-mode along with God-mode as an Evil state. I've tried Meow and didn't like it as much. I've tried God-mode as is and loved it, except that it lacked the pure Vim bindings. One issue that I'm still having is that =C-u= to scroll still doesn't work and I don't know why.

Note that there is a ~elpaca-wait~ call at the end because some customizations I use require Evil to be loaded.

#+begin_src emacs-lisp
  (use-package evil :ensure t
    :init
    (setq evil-want-keybinding nil
          evil-undo-system 'undo-redo
          evil-default-state 'normal
          evil-want-C-i-jump t
          evil-want-C-w-delete t
          evil-want-Y-yank-to-eol t
          evil-want-C-u-scroll t
          evil-want-C-d-scroll t)
    :config (evil-mode 1))

  (use-package evil-collection :ensure t :after evil
    :init (evil-collection-init))

  (use-package evil-god-state :ensure t :after evil
    :config
    (evil-define-key 'normal 'global "\\" 'evil-execute-in-god-state)
    (evil-define-key 'god 'global "escape" 'evil-god-state-bail))

  (use-package evil-surround :ensure t :after evil
    :config (global-evil-surround-mode 1))

  (use-package evil-commentary :ensure t :after evil
    :config (evil-commentary-mode))

  (use-package evil-numbers :ensure t :after evil
    :config
    (evil-define-key '(normal visual) 'global
      (kbd "C-a") 'evil-numbers/inc-at-pt
      (kbd "C-x") 'evil-numbers/dec-at-pt
      (kbd "g C-a") 'evil-numbers/inc-at-pt-incremental
      (kbd "g C-x") 'evil-numbers/dec-at-pt-incremental))

  (elpaca-wait)
#+end_src


* GitHub, Copilot and other AI stuff

This sets up three major plugins: Magit (all hail), Copilot, and GPTel. Elpaca throws some weird errors if I don't include the transient =use-package= call.

#+begin_src emacs-lisp
  (use-package transient
    :ensure t)
  (use-package magit
    :ensure t)
#+end_src

Here, I set up the AI-based stuff like copilot (for completions) and GPTel (for other LLM and agent capabilities). I still need to get a handle on what GPTel can do for my particular use case.

#+begin_src emacs-lisp
  (use-package copilot
    :vc (:url "https://github.com/copilot-emacs/copilot.el"
  	    :rev :newest
  	    :branch "main")
    :ensure t
    :hook (prog-mode . (lambda ()
  		       (unless (file-remote-p default-directory)
  			 copilot-mode)))
    :config
    (define-key copilot-completion-map (kbd "<tab>") 'copilot-accept-completion))

  (setq gemini-api-key (with-temp-buffer
  		       (insert-file-contents ".config/emacs/.gemini")
  		       (buffer-string)))

  (use-package gptel
    :ensure t
    :config
    (setq gptel-backend
  	(gptel-make-gemini "Gemini"
  			   :key gemini-api-key
  			   :stream t)
  	gptel-default-mode 'org-mode))
#+end_src

Xenodium has come out with the =agent-shell= package, which I'd like to try out with Gemini CLI. For now, it doesn't seem very stable, so I'll be keeping an eye out on the repo for updates.

#+begin_src emacs-lisp :tangle not-init.el
  (use-package shell-maker
    :ensure t)
  (use-package acp
    :ensure (:host github :repo "xenodium/acp.el"))

  (use-package agent-shell
    :ensure (:host github :repo "xenodium/agent-shell")
    :config
    (setq agent-shell-google-key gemini-api-key))
#+end_src


* Dired

This has some nice features that I would like when using the builtin Dired. The keybinds are to make it more like other Vim-like file managers, particularly Ranger (which is what I used earlier).

#+begin_src emacs-lisp
  (require 'dired)
  (require 'dired-x)
  (setq dired-listing-switches
        "-l --almost-all --human-readable --group-directories-first"
        dired-omit-files
        (concat dired-omit-files "\\|^\\..+$\\|^__pycache__$"))
  (put 'dired-find-alternate-file 'disabled nil)
  (add-hook 'dired-mode-hook 'dired-hide-details-mode)
  (add-hook 'dired-mode-hook 'dired-omit-mode)

  (define-key global-map (kbd "C-x C-d") (lambda () (interactive) (dired ".")))
  (evil-define-key 'normal dired-mode-map
    "g." 'dired-omit-mode
    "h" (lambda () (interactive) (find-file ".."))
    "l" 'dired-find-file
    "L" (lambda () (interactive)
  	(start-process "xdg" nil "xdg-open" (dired-get-file-for-visit)))
    "n" 'evil-search-next
    "N" 'evil-search-previous
    "o" 'dired-sort-toggle-or-edit
    "v" 'dired-toggle-marks
    "m" 'dired-mark
    "u" 'dired-unmark
    "c" 'dired-create-directory
    "t" 'dired-create-empty-file)
  #+end_src

Previews are nice to have, and Prot has a package for this.

#+begin_src emacs-lisp
  (use-package dired-preview
    :ensure t
    :config
    (setq dired-preview-delay 0.1
          dired-preview-max-size (expt 2 23)
          dired-preview-ignored-extensions-regexp
  	(concat "\\."
  		"\\(gz\\|"
  		"zst\\|"
  		"tar\\|"
  		"xz\\|"
  		"rar\\|"
  		"zip\\|"
  		"iso\\|"
  		"epub\\|"
  		"mp4\\|"
  		"flac\\|"
  		"\\)"))
    (dired-preview-global-mode 1))
#+end_src

Dired stuff is still a work in progress.

#+begin_src emacs-lisp :tangle not-init.el
  (use-package dirvish
    :ensure t
    :config
    (dirvish-peek-mode)
    (setq dirvish-attributes '(nerd-icons file-size)))
     #+end_src


