.config/emacs/README.org
* IBuffer

As much as I need some good buffer management tools, I don't like how IBuffer behaves particularly with evil. This is an attempt to make it that much better.

#+begin_src emacs-lisp
  (eval-after-load 'ibuffer
    '(progn
       (evil-set-initial-state 'ibuffer-mode 'normal)
       (evil-define-key 'normal ibuffer-mode-map
         (kbd "v") 'ibuffer-toggle-marks
         (kbd "l") 'ibuffer-visit-buffer)))

  (setq ibuffer-saved-filter-groups
        '(("custom"
  	 ("Emacs config" (filename . ".config/emacs"))
  	 ("QTile config" (filename . ".config/qtile"))
  	 ("Org files" (mode . org-mode))
  	 ("Code" (derived-mode . prog-mode))
  	 ("Shell scripts" (mode . sh-mode))
  	 ("Text files" (and (mode . text-mode)
  			    (not (starred-name))))
  	 ("Dired" (mode . dired-mode))
  	 ("Magit" (name . "\*magit"))
  	 ("Auxiliary buffers" (starred-name)))))
  (setq ibuffer-show-empty-filter-groups nil
        ibuffer-use-header-line nil
        ibuffer-display-summary nil
        ibuffer-eliding-string "…"
        ibuffer-marked-char ?\
        ibuffer-modified-char ?\
        ibuffer-read-only-char ?\
        ibuffer-deletion-char ?\)
#+end_src

The next snippet is all about making the IBuffer buffer that much prettier. This is also pretty much mooched off of Nicolas Rougier's NANO-sidebar package.

#+begin_src emacs-lisp
  (defun ibuffer-advice (_format)
    (with-current-buffer "*Ibuffer*"
      (save-excursion
      (let ((inhibit-read-only t))

        ;; Remove header and insert ours
        (goto-char (point-min))
        (search-forward " \n" nil t)
        (search-forward " \n" nil t)
        (delete-region 1 (point))
        (goto-char (point-min))
        (insert (concat
                 (propertize "\n" 'face '(:height 0.8))
                 (propertize "Buffer List"
                             'face `(org-document-title variable-pitch))
                 (propertize " "  'display `(raise -0.35))
                 "\n"))
        (insert "")

        ;; Transform titles
        (goto-char (point-min))
        (while (re-search-forward "\\[ \\(.*\\) \\]" nil t)
          (let* ((title (match-string 0))
                 (property (get-text-property 0 'ibuffer-filter-group-name title)))
            (replace-match "\n")
            (insert (concat
                     (propertize
                      (substring title 2 -2)
                      'ibuffer-filter-group-name property
  		      'face '(org-level-2 variable-pitch))
                     "\n"))))))))

  (defun ibuffer-setup ()
    (ibuffer-switch-to-saved-filter-groups "custom")
    (ibuffer-auto-mode 1))

  (advice-add 'ibuffer-update-title-and-summary :after #'ibuffer-advice)
  (add-hook 'ibuffer-mode-hook #'ibuffer-setup)
  (define-key global-map (kbd "C-x C-b") 'ibuffer)
#+end_src


* Calc

A dedicated LaTeX mode wasn't enough, now we actually have to do math. The horror!
Jokes aside, I've seen the power of Emacs' built in calculator and I'm sold. I'm also looking forward to the release of Karthink's work on using latex in calc first class.

*NB:* I was going to add casual to this, but I'm considering abandoning it for the built-in [[Which-Key]]

#+begin_src emacs-lisp
#+end_src


* Which-Key

It occurs to me that I am not an Emacs dictionary. Who'd have thunk?

#+begin_src emacs-lisp
  (which-key-mode 1)
  (which-key-setup-side-window-bottom)
  (which-key-enable-god-mode-support)
#+end_src


* Regex builder

I'm starting to find too many insanely cool builtin features in Emacs. The Interactive Regex Builder is another in that huge list.

#+begin_src emacs-lisp
  (require 're-builder)
  (setq reb-re-syntax 'string)
#+end_src


* PDF Tools and ePub reading

This section was originally about LaTeX and its rendering. Now, it's purely for packages that allow reading PDFs and ePubs in Emacs.
*NB:* =nov= for ePubs is kinda jank. I'll have to come up with something better.

#+begin_src emacs-lisp
  (use-package pdf-tools
    :ensure t
    :init
    (pdf-tools-install)
    :hook (pdf-view-mode . (lambda () (pdf-view-themed-minor-mode 1))))

  (use-package nov
    :ensure t)
#+end_src


* Completions and Spellchecking

** Completions at point

I'm (not really) using Corfu at the moment. Haven't tried out other completion frameworks

#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :config
    (setq corfu-auto t)
    (global-corfu-mode))
#+end_src

** Spell checking

For spellchecking, I did try out jinx, but never ended up actually using it. Apparently Grammarly's Language Server borked itself, so now I'm switching to the OSS variant called LanguageTool (a maintained fork called LTeX+). Let's see how that goes. For now it's bugged out of its tiny little mind.

#+begin_src emacs-lisp :tangle not-init.el
  (use-package eglot-ltex-plus
    :ensure (:host github :repo "emacs-langtool/eglot-ltex-plus")
    :hook
    ((text-mode markdown-mode org-mode) . (lambda ()
  					  (require 'eglot-ltex-plus)
  					  (eglot-ensure)))
    :init
    (setq eglot-ltex-server-path "~/.config/emacs/ltex/ltex-ls-plus-18.5.1"
  	eglot-ltex-communication-channel 'stdio))
#+end_src

** Syntax checking and diagnostics

For syntax checking, I'm starting to use flymake-mode, which should integrate decently with the version of ~nano-modeline~ that I have.
I'm using custom fringe bitmaps to indicate the locations of errors, warnings and notes.

#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook #'flymake-mode)
  (evil-define-key 'normal flymake-mode-map "]d" 'flymake-goto-next-error)
  (evil-define-key 'normal flymake-mode-map "[d" 'flymake-goto-prev-error)
  (setq flymake-start-on-flymake-mode t
        flymake-indicator-type 'fringes)
#+end_src


* Terminal shenanigans

I'm pretty much set on using =emacs-eat= as a terminal with Eshell. I just need to figure out how to make it look nice, and how to personalize it to my usage. One superpower I read about on Reddit was the usage of snippets in the terminal with YASnippet.

#+begin_src emacs-lisp
  (use-package eat
    :ensure t)
#+end_src

Some eshell niceties are to be expected :P

#+begin_src emacs-lisp
  (setq eshell-prompt-function
  	  (lambda ()
  	    (concat
  	     (propertize "\n" 'face `(:foreground ,(catppuccin-color 'text)
  				      :extend t
  				      :underline ,(catppuccin-color 'subtext0)))
  	     (propertize " " 'face `(:foreground ,(catppuccin-color 'text)
  				     :height 1.6
  				     :weight 'bold))
  	     (propertize "" 'face `(:foreground ,(catppuccin-color 'mauve)
  				     :weight 'bold))
  	     (propertize " " 'face `(:foreground ,(catppuccin-color 'text)
  				     :extend t)))))

  (define-key global-map (kbd "C-x C-s") 'eshell)
#+end_src


* Org Mode and $\LaTeX$

All hail the OrgMode system! Lots of very helpful modules have been used here, and several more can be added once I start getting more comfortable with them.

** Actual Org and LaTeX

First, since we're using ~org-cdlatex-mode~, we need to also install auctex, which might cause some issues.

#+begin_src emacs-lisp
  (use-package auctex
    :ensure (:repo "https://git.savannah.gnu.org/git/auctex.git"
             :branch "main"
  	   :pre-build (("make" "elpa"))
  	   :build (:not elpaca--compile-info)
  	   :files ("*.el" "doc/*.info*" "etc" "images" "latex" "style")
             :version (lambda (_) (require 'auctex) AUCTeX-version)))

  (use-package cdlatex
    :ensure t)
#+end_src

Now we can get back to org.

#+begin_src emacs-lisp
    (cl-pushnew 'org elpaca-ignored-dependencies)

    (use-package org
      :ensure nil
      :hook (org-mode . visual-line-mode)
      :hook (org-mode . mixed-pitch-mode)
      :hook (org-mode . org-display-inline-images)
      :hook (org-mode . turn-on-org-cdlatex)
      :config
      (setq org-ellipsis "..."
    	org-fontify-quote-and-verse-blocks t
            org-hide-emphasis-markers t
            org-hide-leading-stars nil
    	org-cycle-separator-lines 2
            org-pretty-entities t
            org-use-sub-superscripts t
            org-format-latex-options (plist-put org-format-latex-options :scale 1.25)
            org-latex-src-block-backend 'listings
    	org-latex-packages-alist '(("" "amsmath" t)
    				   ("" "amssymb" t)
    				   ("" "mathtools" t)
    				   ("" "braket" t)
    				   ("" "physics" t)
    				   ("" "xcolor" t)
    				   ("" "tikz" t)
    				   ("" "tikz-cd" t))
    	org-todo-keywords '((sequence "TODO" "DOING" "|" "DONE")
    			    (sequence "HOLD" "|" "NOPE"))
    	org-priority-highest 0
            org-priority-lowest 9
    	org-priority-default 5
    	org-agenda-files '("~/Notes/agenda.org")
    	org-hidden-keywords '(title author date)
    	org-src-window-setup 'current-window
            org-capture-templates
            '(("t" "Todo" entry
       	   (file+headline "~/Notes/Productivity/refile.org" "Tasks to refile")
               "* TODO %?\n  %i\n  %a")))
      (org-babel-do-load-languages
       'org-babel-load-languages
       '((emacs-lisp . t)
         (latex . t)
         (python . t)))
      (setf (cdr (assoc 'file org-link-frame-setup)) 'find-file))
#+end_src

