.config/emacs/init.el

(eval-after-load 'ibuffer
  '(progn
     (evil-set-initial-state 'ibuffer-mode 'normal)
     (evil-define-key 'normal ibuffer-mode-map
       (kbd "v") 'ibuffer-toggle-marks
       (kbd "l") 'ibuffer-visit-buffer)))

(setq ibuffer-saved-filter-groups
      '(("custom"
	 ("Emacs config" (filename . ".config/emacs"))
	 ("QTile config" (filename . ".config/qtile"))
	 ("Org files" (mode . org-mode))
	 ("Code" (derived-mode . prog-mode))
	 ("Shell scripts" (mode . sh-mode))
	 ("Text files" (and (mode . text-mode)
			    (not (starred-name))))
	 ("Dired" (mode . dired-mode))
	 ("Magit" (name . "\*magit"))
	 ("Auxiliary buffers" (starred-name)))))
(setq ibuffer-show-empty-filter-groups nil
      ibuffer-use-header-line nil
      ibuffer-display-summary nil
      ibuffer-eliding-string "…"
      ibuffer-marked-char ?\
      ibuffer-modified-char ?\
      ibuffer-read-only-char ?\
      ibuffer-deletion-char ?\)

(defun ibuffer-advice (_format)
  (with-current-buffer "*Ibuffer*"
    (save-excursion
    (let ((inhibit-read-only t))

      ;; Remove header and insert ours
      (goto-char (point-min))
      (search-forward " \n" nil t)
      (search-forward " \n" nil t)
      (delete-region 1 (point))
      (goto-char (point-min))
      (insert (concat
               (propertize "\n" 'face '(:height 0.8))
               (propertize "Buffer List"
                           'face `(org-document-title variable-pitch))
               (propertize " "  'display `(raise -0.35))
               "\n"))
      (insert "")

      ;; Transform titles
      (goto-char (point-min))
      (while (re-search-forward "\\[ \\(.*\\) \\]" nil t)
        (let* ((title (match-string 0))
               (property (get-text-property 0 'ibuffer-filter-group-name title)))
          (replace-match "\n")
          (insert (concat
                   (propertize
                    (substring title 2 -2)
                    'ibuffer-filter-group-name property
		      'face '(org-level-2 variable-pitch))
                   "\n"))))))))

(defun ibuffer-setup ()
  (ibuffer-switch-to-saved-filter-groups "custom")
  (ibuffer-auto-mode 1))

(advice-add 'ibuffer-update-title-and-summary :after #'ibuffer-advice)
(add-hook 'ibuffer-mode-hook #'ibuffer-setup)
(define-key global-map (kbd "C-x C-b") 'ibuffer)



(which-key-mode 1)
(which-key-setup-side-window-bottom)
(which-key-enable-god-mode-support)

(use-package pdf-tools
  :ensure t
  :init
  (pdf-tools-install)
  :hook (pdf-view-mode . (lambda () (pdf-view-themed-minor-mode 1))))

(use-package nov
  :ensure t)

(use-package corfu
  :ensure t
  :config
  (setq corfu-auto t)
  (global-corfu-mode))

(add-hook 'prog-mode-hook #'flymake-mode)
(evil-define-key 'normal flymake-mode-map "]d" 'flymake-goto-next-error)
(evil-define-key 'normal flymake-mode-map "[d" 'flymake-goto-prev-error)
(setq flymake-start-on-flymake-mode t
      flymake-indicator-type 'fringes)

(use-package eat
  :ensure t)

(setq eshell-prompt-function
	  (lambda ()
	    (concat
	     (propertize "\n" 'face `(:foreground ,(catppuccin-color 'text)
				      :extend t
				      :underline ,(catppuccin-color 'subtext0)))
	     (propertize " " 'face `(:foreground ,(catppuccin-color 'text)
				     :height 1.6
				     :weight 'bold))
	     (propertize "" 'face `(:foreground ,(catppuccin-color 'mauve)
				     :weight 'bold))
	     (propertize " " 'face `(:foreground ,(catppuccin-color 'text)
				     :extend t)))))

(define-key global-map (kbd "C-x C-s") 'eshell)

(use-package auctex
  :ensure (:repo "https://git.savannah.gnu.org/git/auctex.git"
           :branch "main"
	   :pre-build (("make" "elpa"))
	   :build (:not elpaca--compile-info)
	   :files ("*.el" "doc/*.info*" "etc" "images" "latex" "style")
           :version (lambda (_) (require 'auctex) AUCTeX-version)))

(use-package cdlatex
  :ensure t)

(cl-pushnew 'org elpaca-ignored-dependencies)

(use-package org
  :ensure nil
  :hook (org-mode . visual-line-mode)
  :hook (org-mode . mixed-pitch-mode)
  :hook (org-mode . org-display-inline-images)
  :hook (org-mode . turn-on-org-cdlatex)
  :config
  (setq org-ellipsis "..."
	org-fontify-quote-and-verse-blocks t
        org-hide-emphasis-markers t
        org-hide-leading-stars nil
	org-cycle-separator-lines 2
        org-pretty-entities t
        org-use-sub-superscripts t
        org-format-latex-options (plist-put org-format-latex-options :scale 1.25)
        org-latex-src-block-backend 'listings
	org-latex-packages-alist '(("" "amsmath" t)
				   ("" "amssymb" t)
				   ("" "mathtools" t)
				   ("" "braket" t)
				   ("" "physics" t)
				   ("" "xcolor" t)
				   ("" "tikz" t)
				   ("" "tikz-cd" t))
	org-todo-keywords '((sequence "TODO" "DOING" "|" "DONE")
			    (sequence "HOLD" "|" "NOPE"))
	org-priority-highest 0
        org-priority-lowest 9
	org-priority-default 5
	org-agenda-files '("~/Notes/agenda.org")
	org-hidden-keywords '(title author date)
	org-src-window-setup 'current-window
        org-capture-templates
        '(("t" "Todo" entry
   	   (file+headline "~/Notes/Productivity/refile.org" "Tasks to refile")
           "* TODO %?\n  %i\n  %a")))
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (latex . t)
     (python . t)))
  (setf (cdr (assoc 'file org-link-frame-setup)) 'find-file))
