.config/emacs/README.org
** Org-Roam

I'll start using Zettelkasten for my notes, because otherwise I'll end up creating multiple unnecessarily redundant files with either too little or too much information.

#+begin_src emacs-lisp
  (use-package org-roam
    :ensure t
    :config
    (setq org-roam-directory "~/Notes")
    (org-roam-db-autosync-mode)
    :bind (("C-c n f" . 'org-roam-node-find)
  	 ("C-c n i" . 'org-roam-node-insert)
  	 ("C-c n g" . 'org-roam-graph)
	   ("C-c n c" . 'org-roam-capture)))
#+end_src

** Jupyter and other Babel shenanigans

Babel is a module of Org mode that deals with other programming languages and how they integrate with Org. These integrations include "tangling" (bundling all codeblocks in an org file into an actual code file), and running in the file itself.

I use this module greatly for treating Jupyter notebooks and Org files like each other.

This also includes an Export module to export an org file as a Jupyter notebook

#+begin_src emacs-lisp
  (use-package ob-ipython
    :ensure t
    :after org
    :config
    (add-to-list 'org-babel-load-languages '(ipython . t))
    (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages))

  (use-package jupyter
    :ensure t
    :after org
    :config
    (add-to-list 'org-babel-load-languages '(jupyter . t))
    (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages))

(use-package ox-ipynb
  :ensure (ox-ipynb :host github :repo "jkitchin/ox-ipynb")
  :after org)
#+end_src

*** Auto tangling

#+begin_src emacs-lisp
  (use-package org-auto-tangle
    :ensure t
    :after org
    :hook (org-mode . org-auto-tangle-mode))
#+end_src

** Citation management

Zotero is a gem, but it's a little messy to integrate into my Org-LaTeX documents, but I've heard of Citar which seems to make it /schmooth/.

#+begin_src emacs-lisp
  (use-package citar
    :ensure t
    :custom
    (org-cite-global-bibliography '("~/Research/Bibliography/NLP-Stuff.bib"
  				  "~/Research/Bibliography/Math-Stuff.bib"
  				  "~/Research/Bibliography/Other-Fun-Stuff.bib"))
    (org-cite-insert-processor 'citar)
    (org-cite-follow-processor 'citar)
    (org-cite-activate-processor 'citar)
    (citar-bibliography org-cite-global-bibliography)
    :bind
    (:map org-mode-map :package org ("C-c i" . #'org-cite-insert))
    :config
    (defvar citar-indicator-notes-icons
      (citar-indicator-create
       :symbol (nerd-icons-mdicon
  	      "nf-md-notebook"
  	      :face 'nerd-icons-blue
  	      :v-adjust -0.3)
       :function #'citar-has-notes
       :padding "  "
       :tag "has:notes"))

    (defvar citar-indicator-links-icons
      (citar-indicator-create
       :symbol (nerd-icons-octicon
                "nf-oct-link"
                :face 'nerd-icons-orange
                :v-adjust -0.1)
       :function #'citar-has-links
       :padding "  "
       :tag "has:links"))

    (defvar citar-indicator-files-icons
      (citar-indicator-create
       :symbol (nerd-icons-faicon
                "nf-fa-file"
                :face 'nerd-icons-green
                :v-adjust -0.1)
       :function #'citar-has-files
       :padding "  "
       :tag "has:files"))
    (setq citar-indicators
  	(list citar-indicator-files-icons
  	      citar-indicator-notes-icons
  	      citar-indicator-links-icons)))

#+end_src

** UI Stuff

These are some nice-to-haves that make Org files look good in Emacs.

#+begin_src emacs-lisp
  (use-package org-autolist
    :ensure t
    :after org
    :hook (org-mode . org-autolist-mode))

  (use-package mixed-pitch
    :ensure t
    :after org
    :hook (org-mode . mixed-pitch-mode))
#+end_src

*** Markdown

Markdown is surprisingly similar to Org notation, but the rendering isn't nearly as good. I'll be fixing that here (as much as I can). Some changes are in the [[Face Overrides]] subsection of the themes section.

There's also a neat little toggle for the plaintext vs rendered text mode.

#+begin_src emacs-lisp
  (add-hook 'markdown-mode-hook #'mixed-pitch-mode)
  (add-hook 'markdown-view-mode-hook #'mixed-pitch-mode)

  (defun drs/toggle-view ()
    "Toggle markdown view mode."
    (interactive)
    (if (eq major-mode 'markdown-mode)
        (markdown-view-mode)
      (markdown-mode)))
  (add-hook 'markdown-mode-hook (lambda ()
  				(define-key markdown-mode-map (kbd "C-c m")
  					    'drs/toggle-view)))
#+end_src


* Treesitter and LSP

This feels more comfortable and simultaneously not. I need to get more comfortable with both of these as they are implemented in Emacs.

#+begin_src emacs-lisp
  (use-package treesit-auto
    :ensure t
    :custom
    (treesit-auto-install 'prompt)
    :config
    (treesit-auto-add-to-auto-mode-alist 'all)
    (global-treesit-auto-mode))

  (setq treesit-font-lock-level 4)

  (use-package exec-path-from-shell
    :ensure t
    :config
    (exec-path-from-shell-initialize))

  (evil-define-key 'normal eglot-mode-map
    (kbd "g Q") 'eglot-format-buffer
    (kbd "g R") 'eglot-rename
    (kbd "g C") 'eglot-code-actions)
#+end_src

Another programming nice-to-have :P

#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook #'electric-pair-mode)
#+end_src


* Snippets

I'm starting to get the idea that snippets are going to be very useful. (Who'd have thought?)
I'm using good old =yasnippet= for this.

#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (yas-global-mode 1)
    (setq yas-snippet-dirs '(".config/emacs/snippets")))
    #+end_src


* Minibuffer (basically Vertico)

This customizes the way the Minibuffer works in Emacs.

Dream feature (which is honestly impossible): I'd like Evil to mimic the use of native features in completion, in the sense that =:= ends up behaving like =M-x= in the way it pops up vertico with completions. Similarly with =/= and =consult-line= and so on.

#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :config
    (vertico-buffer-mode)
    (vertico-mode 1)
    (setq vertico-preselect 'first
  	vertico-count 10
  	vertico-resize nil))

  (use-package marginalia
    :ensure t
    :config
    (marginalia-mode))

  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles basic partial-completion)))))

  (use-package consult
    :ensure t
    :config
    (setq completion-in-region-function 'consult-completion-in-region))
#+end_src


* RSS Feeds

I'll be using Elfeed as my RSS reader for news and tech updates.

#+begin_src emacs-lisp
  (use-package stripes :ensure t)
  (use-package elfeed :ensure t)
  (use-package elfeed-org :ensure t :after elfeed :config (elfeed-org))
#+end_src


* Other esoteric stuff

Stuff that is just here to get one task or a few tasks done, not worth going too deep into.

** Dyalog APL

I did try learning Dyalog APL for the APL Forge contest, and found it quite cool. Nice to have a minor mode (and sometime later, and input-mode) for it. Not in use currently

#+begin_src emacs-lisp :tangle not-init.el
  (use-package dyalog-mode
    :ensure t
    :config
    (defun org-babel-execute:dyalog (body params)
      (org-babel-execute:jupyter-apl body params))

    (defun org-babel-dyalog-initiate-session (&optional arg1 arg2)
      (org-babel-jupyter-apl-initiate-session &optional arg1 arg2))

    (setq org-babel-default-header-args:jupyter-apl '((:kernel . "dyalog_apl")
                                                      (:session . "*new*")
                                                      (:exports . "both")
                                                      (:eval . "never-export"))

          org-babel-default-header-args:dyalog '((:kernel . "dyalog_apl")
                                                 (:session . "*new*")
                                                 (:exports . "both")
                                                 (:eval . "never-export"))))
#+end_src


* NΛNO Emacs modules

This is the bit that was (more or less) entirely copy-pasted from Nicolas Rougier's repositories. These are what make Emacs look so incredibly clean. After yoinking them from the repos, I've made major changes to them in order to make them more compatible with my editing style and colour scheme.

For now, I'll be keeping all the Elisp in separate files in the =nano/= directory and ~require~-ing them here. Ideally I would like to include all Elisp in this file, but that might make this unreadable.

#+begin_src emacs-lisp
  (add-hook 'elpaca-after-init-hook
            (lambda ()
              (progn
                (require 'nano-modeline)
                (nano-modeline nil nil t)
                (require 'nano-vertico)
                (nano-vertico-mode)

                (require 'nano-splash)
                (require 'nano-calendar)
                (require 'nano-agenda)

                (require 'nano-read)
  	      (require 'nano-sidebar)

                (require 'nano-org)

                ;; (require 'nano-elfeed)
                (require 'nano-kill)
                (require 'nano-block))))
#+end_src
  
                
