.config/emacs/init.el

(use-package org-roam
  :ensure t
  :config
  (setq org-roam-directory "~/Notes")
  (org-roam-db-autosync-mode)
  :bind (("C-c n f" . 'org-roam-node-find)
	 ("C-c n i" . 'org-roam-node-insert)
	 ("C-c n g" . 'org-roam-graph)
	   ("C-c n c" . 'org-roam-capture)))

(use-package ob-ipython
    :ensure t
    :after org
    :config
    (add-to-list 'org-babel-load-languages '(ipython . t))
    (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages))

  (use-package jupyter
    :ensure t
    :after org
    :config
    (add-to-list 'org-babel-load-languages '(jupyter . t))
    (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages))

(use-package ox-ipynb
  :ensure (ox-ipynb :host github :repo "jkitchin/ox-ipynb")
  :after org)

(use-package org-auto-tangle
  :ensure t
  :after org
  :hook (org-mode . org-auto-tangle-mode))

(use-package citar
  :ensure t
  :custom
  (org-cite-global-bibliography '("~/Research/Bibliography/NLP-Stuff.bib"
				  "~/Research/Bibliography/Math-Stuff.bib"
				  "~/Research/Bibliography/Other-Fun-Stuff.bib"))
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
  (citar-bibliography org-cite-global-bibliography)
  :bind
  (:map org-mode-map :package org ("C-c i" . #'org-cite-insert))
  :config
  (defvar citar-indicator-notes-icons
    (citar-indicator-create
     :symbol (nerd-icons-mdicon
	      "nf-md-notebook"
	      :face 'nerd-icons-blue
	      :v-adjust -0.3)
     :function #'citar-has-notes
     :padding "  "
     :tag "has:notes"))

  (defvar citar-indicator-links-icons
    (citar-indicator-create
     :symbol (nerd-icons-octicon
              "nf-oct-link"
              :face 'nerd-icons-orange
              :v-adjust -0.1)
     :function #'citar-has-links
     :padding "  "
     :tag "has:links"))

  (defvar citar-indicator-files-icons
    (citar-indicator-create
     :symbol (nerd-icons-faicon
              "nf-fa-file"
              :face 'nerd-icons-green
              :v-adjust -0.1)
     :function #'citar-has-files
     :padding "  "
     :tag "has:files"))
  (setq citar-indicators
	(list citar-indicator-files-icons
	      citar-indicator-notes-icons
	      citar-indicator-links-icons)))

(use-package org-autolist
  :ensure t
  :after org
  :hook (org-mode . org-autolist-mode))

(use-package mixed-pitch
  :ensure t
  :after org
  :hook (org-mode . mixed-pitch-mode))

(add-hook 'markdown-mode-hook #'mixed-pitch-mode)
(add-hook 'markdown-view-mode-hook #'mixed-pitch-mode)

(defun drs/toggle-view ()
  "Toggle markdown view mode."
  (interactive)
  (if (eq major-mode 'markdown-mode)
      (markdown-view-mode)
    (markdown-mode)))
(add-hook 'markdown-mode-hook (lambda ()
				(define-key markdown-mode-map (kbd "C-c m")
					    'drs/toggle-view)))

(use-package treesit-auto
  :ensure t
  :custom
  (treesit-auto-install 'prompt)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))

(setq treesit-font-lock-level 4)

(use-package exec-path-from-shell
  :ensure t
  :config
  (exec-path-from-shell-initialize))

(evil-define-key 'normal eglot-mode-map
  (kbd "g Q") 'eglot-format-buffer
  (kbd "g R") 'eglot-rename
  (kbd "g C") 'eglot-code-actions)

(add-hook 'prog-mode-hook #'electric-pair-mode)

(use-package yasnippet
  :ensure t
  :config
  (yas-global-mode 1)
  (setq yas-snippet-dirs '(".config/emacs/snippets")))

(use-package vertico
  :ensure t
  :config
  (setq vertico-preselect 'first
	  vertico-count 10)
  (vertico-mode 1)
  (vertico-buffer-mode))

(use-package marginalia
  :ensure t
  :config
  (marginalia-mode))

(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

(use-package consult
  :ensure t
  :config
  (setq completion-in-region-function 'consult-completion-in-region))

(use-package stripes :ensure t)
(use-package elfeed :ensure t)
(use-package elfeed-org :ensure t :after elfeed :config (elfeed-org))

(add-hook 'elpaca-after-init-hook
          (lambda ()
            (progn
              (require 'nano-modeline)
              (nano-modeline nil nil t)
              (require 'nano-vertico)
              (nano-vertico-mode)

              (require 'nano-splash)
              (require 'nano-calendar)
              (require 'nano-agenda)

              (require 'nano-read)
	      (require 'nano-sidebar)

              (require 'nano-org)

              ;; (require 'nano-elfeed)
              (require 'nano-kill)
              (require 'nano-block))))
